In [1]:
# import modules
import pandas as pd

In [2]:
# Create dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'],
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'name', 'preTestScore', 'postTestScore'])

In [3]:
df

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [6]:
df['preTestScore'].groupby([df['regiment'], df['company']]).mean().unstack()

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

In [35]:
tst = pd.read_csv("test1.csv")
tst.head()

   NNC Assay  Conc  Val  Unnamed: 4
0    1    A1   333  3.1         NaN
1    1    A2   333  4.1         NaN
2    2    A1   333  5.1         NaN
3    2    A2   333  6.1         NaN
4    3    A3   333  7.1         NaN

In [47]:
import numpy as np
from scipy import stats as scistats

tst['Val'] = tst['Val'].astype(float)

# scistats.gmean

# works
a = tst.groupby(['NNC','Conc'])['Val'].apply(scistats.gmean)
# tst['geom'] = tst.groupby(['NNC','Conc'])['Val'].transform(scistats.gmean)

In [29]:
tst.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
NNC           8 non-null int64
Assay         8 non-null object
Conc          8 non-null int64
Val           8 non-null float64
Unnamed: 4    0 non-null float64
dtypes: float64(2), int64(2), object(1)
memory usage: 392.0+ bytes

In [48]:
a

NNC  Conc
1    333     3.565109
2    333     5.577634
3    333     7.583535
4    333     9.639502
Name: Val, dtype: float64